Repository: handshake-rs/hns-dane-browser-mobile
Catalog: ios/HnsDaneBrowser/Support/Wallet.xcstrings
Source language: en
Languages: ar, de, es, fa, fr, he, hi, id, it, ja, ko, nl, pl, pt, ru, tr, uk, vi, zh_hans, zh_hant

# wallet_swap_funding_approval_message
source: Lock %1$d sats. Network fee: %2$d sats (maximum %3$d). Transaction: %4$@ Session: %5$@ Broadcast is irreversible. The swap advances after the Bitcoin lock is confirmed.
ar: اقفل %1$d سات. رسوم الشبكة: %2$d سات (الحد الأقصى %3$d). المعاملة: %4$@ الجلسة: %5$@ البث غير قابل للتراجع. تتقدم المبادلة بعد تأكيد قفل Bitcoin.
de: %1$d Sats sperren. Netzwerkgebühr: %2$d Sats (maximal %3$d). Transaktion: %4$@ Sitzung: %5$@ Das Senden ist unumkehrbar. Der Tausch wird nach Bestätigung der Bitcoin-Sperre fortgesetzt.
es: Bloquear %1$d sats. Comisión de red: %2$d sats (máximo %3$d). Transacción: %4$@ Sesión: %5$@ La transmisión es irreversible. El intercambio avanza después de confirmar el bloqueo de Bitcoin.
fa: %1$d سات قفل شود. کارمزد شبکه: %2$d سات (حداکثر %3$d). تراکنش: %4$@ جلسه: %5$@ پخش برگشت‌ناپذیر است. مبادله پس از تأیید قفل Bitcoin ادامه می‌یابد.
fr: Verrouiller %1$d sats. Frais réseau : %2$d sats (maximum %3$d). Transaction : %4$@ Session : %5$@ La diffusion est irréversible. L’échange avance après confirmation du verrouillage Bitcoin.
he: נעילת %1$d סאט. עמלת רשת: %2$d סאט (מקסימום %3$d). עסקה: %4$@ הפעלה: %5$@ השידור בלתי הפיך. ההחלפה מתקדמת לאחר אישור נעילת Bitcoin.
hi: %1$d सैट लॉक करें। नेटवर्क शुल्क: %2$d सैट (अधिकतम %3$d)। लेन-देन: %4$@ सत्र: %5$@ प्रसारण अपरिवर्तनीय है। Bitcoin लॉक पुष्ट होने के बाद स्वैप आगे बढ़ता है।
id: Kunci %1$d sat. Biaya jaringan: %2$d sat (maksimum %3$d). Transaksi: %4$@ Sesi: %5$@ Penyiaran tidak dapat dibatalkan. Pertukaran berlanjut setelah kunci Bitcoin dikonfirmasi.
it: Blocca %1$d sat. Commissione di rete: %2$d sat (massimo %3$d). Transazione: %4$@ Sessione: %5$@ La trasmissione è irreversibile. Lo scambio avanza dopo la conferma del blocco Bitcoin.
ja: %1$d satsをロックします。ネットワーク手数料：%2$d sats（最大%3$d）。 トランザクション：%4$@ セッション：%5$@ ブロードキャストは取り消せません。Bitcoinロックの確定後にスワップが進みます。
ko: %1$d sats를 잠급니다. 네트워크 수수료: %2$d sats(최대 %3$d). 트랜잭션: %4$@ 세션: %5$@ 브로드캐스트는 되돌릴 수 없습니다. Bitcoin 잠금 확인 후 스왑이 진행됩니다.
nl: %1$d sats vergrendelen. Netwerkkosten: %2$d sats (maximaal %3$d). Transactie: %4$@ Sessie: %5$@ Uitzenden is onomkeerbaar. De ruil gaat verder nadat de Bitcoin-vergrendeling is bevestigd.
pl: Zablokuj %1$d sats. Opłata sieciowa: %2$d sats (maksymalnie %3$d). Transakcja: %4$@ Sesja: %5$@ Rozgłoszenie jest nieodwracalne. Wymiana postępuje po potwierdzeniu blokady Bitcoin.
pt: Bloqueie %1$d sats. Taxa de rede: %2$d sats (máximo %3$d). Transação: %4$@ Sessão: %5$@ A transmissão é irreversível. A troca avança após a confirmação do bloqueio Bitcoin.
ru: Заблокировать %1$d sats. Комиссия сети: %2$d sats (максимум %3$d). Транзакция: %4$@ Сессия: %5$@ Отправка необратима. Обмен продолжится после подтверждения блокировки Bitcoin.
tr: %1$d sats kilitleyin. Ağ ücreti: %2$d sats (azami %3$d). İşlem: %4$@ Oturum: %5$@ Yayın geri alınamaz. Takas, Bitcoin kilidi onaylandıktan sonra ilerler.
uk: Заблокувати %1$d sats. Комісія мережі: %2$d sats (максимум %3$d). Транзакція: %4$@ Сесія: %5$@ Надсилання незворотне. Обмін продовжиться після підтвердження блокування Bitcoin.
vi: Khóa %1$d sats. Phí mạng: %2$d sats (tối đa %3$d). Giao dịch: %4$@ Phiên: %5$@ Việc phát là không thể đảo ngược. Hoán đổi tiếp tục sau khi khóa Bitcoin được xác nhận.
zh_hans: 锁定 %1$d 聪。网络费用：%2$d 聪（最高 %3$d）。 交易：%4$@ 会话：%5$@ 广播不可撤销。确认 Bitcoin 锁定后，兑换才会继续。
zh_hant: 鎖定 %1$d 聰。網路費用：%2$d 聰（最高 %3$d）。 交易：%4$@ 工作階段：%5$@ 廣播無法撤銷。確認 Bitcoin 鎖定後，兌換才會繼續。

# wallet_swap_funding_approval_title
source: Broadcast Bitcoin funding?
ar: بث تمويل Bitcoin؟
de: Bitcoin-Finanzierung senden?
es: ¿Transmitir la financiación en Bitcoin?
fa: پخش تأمین وجه Bitcoin؟
fr: Diffuser le financement Bitcoin ?
he: לשדר מימון Bitcoin?
hi: Bitcoin फंडिंग प्रसारित करें?
id: Siarkan pendanaan Bitcoin?
it: Trasmettere il finanziamento Bitcoin?
ja: Bitcoin資金供給をブロードキャストしますか？
ko: Bitcoin 자금 공급을 브로드캐스트할까요?
nl: Bitcoin-financiering uitzenden?
pl: Rozgłosić finansowanie Bitcoin?
pt: Transmitir financiamento Bitcoin?
ru: Отправить финансирование Bitcoin?
tr: Bitcoin fonlaması yayınlansın mı?
uk: Надіслати фінансування Bitcoin?
vi: Phát giao dịch cấp vốn Bitcoin?
zh_hans: 广播 Bitcoin 资金交易？
zh_hant: 廣播 Bitcoin 資金交易？

# wallet_swap_funding_broadcast_failed
source: The Bitcoin HTLC funding transaction was not submitted.
ar: لم يتم إرسال معاملة التمويل Bitcoin HTLC.
de: Die Finanzierungstransaktion Bitcoin HTLC wurde nicht übermittelt.
es: No se envió la transacción de financiación Bitcoin HTLC.
fa: تراکنش تامین مالی Bitcoin HTLC ارسال نشد.
fr: La transaction de financement Bitcoin HTLC n'a pas été soumise.
he: עסקת המימון Bitcoin HTLC לא הוגשה.
hi: Bitcoin HTLC फंडिंग लेनदेन प्रस्तुत नहीं किया गया था।
id: Transaksi pendanaan Bitcoin HTLC tidak diajukan.
it: La transazione di finanziamento Bitcoin HTLC non è stata inviata.
ja: Bitcoin HTLC 資金トランザクションは送信されませんでした。
ko: Bitcoin HTLC 펀딩 거래가 제출되지 않았습니다.
nl: De financieringstransactie Bitcoin HTLC is niet verzonden.
pl: Transakcja finansowania Bitcoin HTLC nie została złożona.
pt: A transação de financiamento Bitcoin HTLC não foi enviada.
ru: Транзакция финансирования Bitcoin HTLC не была отправлена.
tr: Bitcoin HTLC fonlama işlemi gönderilmedi.
uk: Трансакцію фінансування Bitcoin HTLC не було подано.
vi: Giao dịch cấp vốn Bitcoin HTLC chưa được gửi.
zh_hans: Bitcoin HTLC 资金交易未提交。
zh_hant: Bitcoin HTLC 資金交易未提交。

# wallet_swap_funding_fee_hint
source: Maximum Bitcoin funding fee (sats)
ar: الحد الأقصى لرسوم التمويل Bitcoin (sats)
de: Maximale Bitcoin-Finanzierungsgebühr (sats)
es: Tarifa máxima de financiación Bitcoin (sats)
fa: حداکثر هزینه بودجه Bitcoin (sats)
fr: Frais de financement maximum Bitcoin (sats)
he: עמלת מימון מקסימלית Bitcoin (sats)
hi: अधिकतम Bitcoin फंडिंग शुल्क (sats)
id: Biaya pendanaan maksimum Bitcoin (sats)
it: Commissione di finanziamento massima Bitcoin (sats)
ja: 最大 Bitcoin 資金調達手数料 (sats)
ko: 최대 Bitcoin 펀딩 수수료(sats)
nl: Maximale financieringskosten voor Bitcoin (sats)
pl: Maksymalna opłata za finansowanie Bitcoin (sats)
pt: Taxa máxima de financiamento Bitcoin (sats)
ru: Максимальная комиссия за финансирование Bitcoin (sats)
tr: Maksimum Bitcoin finansman ücreti (sats)
uk: Максимальна комісія за фінансування Bitcoin (sats)
vi: Phí cấp vốn tối đa Bitcoin (sats)
zh_hans: 最高Bitcoin资金费用（sats）
zh_hant: 最高Bitcoin資金費用（sats）

# wallet_swap_funding_prepare_failed
source: Bitcoin HTLC funding was not prepared. Confirm the accepted session, current chain state, and signed fee reserve.
ar: لم يتم إعداد تمويل Bitcoin HTLC. قم بتأكيد الجلسة المقبولة وحالة السلسلة الحالية واحتياطي الرسوم الموقعة.
de: Bitcoin HTLC Finanzierung wurde nicht vorbereitet. Bestätigen Sie die akzeptierte Sitzung, den aktuellen Kettenstatus und die unterzeichnete Gebührenreserve.
es: Bitcoin HTLC no se preparó la financiación. Confirme la sesión aceptada, el estado actual de la cadena y la reserva de tarifa firmada.
fa: بودجه Bitcoin HTLC آماده نشد. جلسه پذیرفته شده، وضعیت فعلی زنجیره و ذخیره هزینه امضا شده را تأیید کنید.
fr: Le financement Bitcoin HTLC n’a pas été préparé. Confirmez la session acceptée, l'état actuel de la chaîne et la réserve de frais signée.
he: מימון Bitcoin HTLC לא הוכן. אשר את ההפעלה המקובלת, מצב השרשרת הנוכחי ועתודת האגרה החתומה.
hi: Bitcoin HTLC फंडिंग तैयार नहीं की गई थी। स्वीकृत सत्र, वर्तमान श्रृंखला स्थिति और हस्ताक्षरित शुल्क आरक्षित की पुष्टि करें।
id: Pendanaan Bitcoin HTLC belum disiapkan. Konfirmasikan sesi yang diterima, status rantai saat ini, dan cadangan biaya yang ditandatangani.
it: Bitcoin HTLC il finanziamento non è stato preparato. Conferma la sessione accettata, lo stato attuale della catena e la riserva tariffaria firmata.
ja: Bitcoin HTLC 資金が準備されていませんでした。受け入れられたセッション、現在のチェーン状態、署名された料金予約を確認します。
ko: Bitcoin HTLC 펀딩이 준비되지 않았습니다. 승인된 세션, 현재 체인 상태, 서명된 수수료 예비를 확인하세요.
nl: Bitcoin HTLC financiering was niet voorbereid. Bevestig de geaccepteerde sessie, de huidige ketenstatus en de ondertekende kostenreservering.
pl: Bitcoin HTLC finansowanie nie zostało przygotowane. Potwierdź zaakceptowaną sesję, bieżący stan łańcucha i podpisaną rezerwę opłat.
pt: O financiamento Bitcoin HTLC não foi preparado. Confirme a sessão aceita, o estado atual da cadeia e a reserva de taxa assinada.
ru: Bitcoin HTLC финансирование не было подготовлено. Подтвердите принятый сеанс, текущее состояние цепочки и подписанный резерв комиссии.
tr: Bitcoin HTLC finansmanı hazırlanmadı. Kabul edilen oturumu, mevcut zincir durumunu ve imzalanmış ücret rezervini onaylayın.
uk: Bitcoin HTLC фінансування не було підготовлено. Підтвердьте прийнятий сеанс, поточний стан ланцюга та підписаний резерв комісії.
vi: Nguồn vốn Bitcoin HTLC chưa được chuẩn bị. Xác nhận phiên được chấp nhận, trạng thái chuỗi hiện tại và dự trữ phí đã ký.
zh_hans: Bitcoin HTLC 资金未准备。确认接受的会话、当前的链状态和签名的费用储备。
zh_hant: Bitcoin HTLC 資金未準備。確認接受的會話、目前的鏈狀態和簽署的費用儲備。

# wallet_swap_funding_preparing
source: Preparing exact session-bound Bitcoin HTLC funding…
ar: إعداد تمويل Bitcoin HTLC المحدد للجلسة...
de: Vorbereitung der genauen sitzungsgebundenen Bitcoin HTLC-Finanzierung…
es: Preparando la financiación exacta de Bitcoin HTLC vinculada a la sesión...
fa: در حال آماده سازی بودجه دقیق Bitcoin HTLC محدود به جلسه…
fr: Préparation du financement Bitcoin HTLC exact lié à la session…
he: מכין מימון Bitcoin HTLC המדויק להפעלה...
hi: सटीक सत्र-बाध्य Bitcoin HTLC फंडिंग तैयार की जा रही है...
id: Mempersiapkan pendanaan Bitcoin HTLC terikat sesi yang tepat…
it: Preparazione del finanziamento Bitcoin HTLC esatto legato alla sessione…
ja: 正確なセッション限定の Bitcoin HTLC 資金調達を準備しています…
ko: 정확한 세션 한정 Bitcoin HTLC 펀딩 준비 중…
nl: Exacte sessiegebonden financiering Bitcoin HTLC voorbereiden…
pl: Przygotowywanie dokładnego finansowania Bitcoin HTLC związanego z sesją…
pt: Preparando o financiamento Bitcoin HTLC vinculado à sessão exata…
ru: Подготовка точного финансирования для сессии Bitcoin HTLC…
tr: Kesin oturuma bağlı Bitcoin HTLC finansmanı hazırlanıyor…
uk: Підготовка точного фінансування Bitcoin HTLC, прив’язаного до сесії…
vi: Đang chuẩn bị tài trợ Bitcoin HTLC theo phiên chính xác…
zh_hans: 准备确切的会话绑定 Bitcoin HTLC 资金......
zh_hant: 準備確切的會話綁定 Bitcoin HTLC 資金...

# wallet_swap_funding_submitted
source: Bitcoin HTLC funding %1$@… was submitted. Waiting for independent local confirmation.
ar: تم تقديم تمويل Bitcoin HTLC %1$@.... في انتظار تأكيد محلي مستقل.
de: Bitcoin HTLC Finanzierung %1$@… wurde eingereicht. Warten auf unabhängige lokale Bestätigung.
es: Bitcoin HTLC financiación %1$@… se envió. A la espera de confirmación local independiente.
fa: بودجه Bitcoin HTLC %1$@… ارسال شد. در انتظار تایید محلی مستقل.
fr: Le financement Bitcoin HTLC %1$@… a été soumis. En attente d'une confirmation locale indépendante.
he: מימון Bitcoin HTLC %1$@... הוגש. ממתין לאישור מקומי עצמאי.
hi: Bitcoin HTLC फंडिंग %1$@… प्रस्तुत की गई थी। स्वतंत्र स्थानीय पुष्टि की प्रतीक्षा है.
id: Bitcoin HTLC pendanaan %1$@… telah diserahkan. Menunggu konfirmasi lokal independen.
it: Bitcoin HTLC finanziamento %1$@… è stato inviato. In attesa di conferma locale indipendente.
ja: Bitcoin HTLC 資金調達 %1$@… が送信されました。独立した現地確認を待っています。
ko: Bitcoin HTLC 펀딩 %1$@…이 제출되었습니다. 독립적인 현지 확인을 기다리고 있습니다.
nl: Bitcoin HTLC financiering %1$@… is ingediend. Wachten op onafhankelijke lokale bevestiging.
pl: Bitcoin HTLC finansowanie %1$@… zostało złożone. Czekam na niezależne, lokalne potwierdzenie.
pt: Bitcoin HTLC financiamento %1$@… foi enviado. Aguardando confirmação local independente.
ru: Bitcoin HTLC финансирование %1$@… отправлено. Ждем независимого местного подтверждения.
tr: Bitcoin HTLC finansmanı %1$@… sunuldu. Bağımsız yerel onay bekleniyor.
uk: Bitcoin HTLC фінансування %1$@… було подано. Очікування незалежного місцевого підтвердження.
vi: Bitcoin HTLC tài trợ %1$@… đã được gửi. Đang chờ xác nhận độc lập của địa phương.
zh_hans: Bitcoin HTLC 资金 %1$@… 已提交。等待当地独立确认。
zh_hant: Bitcoin HTLC 資金 %1$@… 已提交。等待當地獨立確認。

# wallet_swap_hns_amount_hint
source: HNS locked (minimum 0.100546 including fee reserve)
ar: HNS مقفل (الحد الأدنى 0.100546 بما في ذلك احتياطي الرسوم)
de: HNS gesperrt (mindestens 0,100546 inklusive Gebührenreserve)
es: HNS bloqueado (mínimo 0,100546 incluida la reserva de tarifa)
fa: HNS قفل شده است (حداقل 0.100546 با احتساب هزینه ذخیره)
fr: HNS verrouillé (minimum 0,100546, réserve de frais comprise)
he: HNS נעול (מינימום 0.100546 כולל רזרבה לתשלום)
hi: HNS लॉक किया गया (शुल्क आरक्षित सहित न्यूनतम 0.100546)
id: HNS terkunci (minimal 0,100546 termasuk cadangan biaya)
it: HNS bloccato (minimo 0,100546 compresa la riserva tariffaria)
ja: HNS ロック済み (手数料準備金を含む最小 0.100546)
ko: HNS 잠김(수수료 예비 포함 최소 0.100546)
nl: HNS vergrendeld (minimaal 0,100546 inclusief vergoedingsreserve)
pl: HNS zablokowany (minimum 0,100546 łącznie z rezerwą opłaty)
pt: HNS bloqueado (mínimo 0,100546 incluindo reserva de taxa)
ru: HNS заблокирован (минимум 0,100546, включая резерв комиссии)
tr: HNS kilitli (ücret rezervi dahil minimum 0,100546)
uk: HNS заблоковано (мінімум 0,100546, включаючи резерв комісії)
vi: HNS bị khóa (tối thiểu 0,100546 bao gồm phí dự trữ)
zh_hans: HNS 锁定（最低 0.100546 包括费用准备金）
zh_hant: HNS 鎖定（最低 0.100546 包括費用準備金）

# wallet_swap_hns_approval_message
source: Lock %1$@ HNS for exactly %2$d sats. The locked amount includes a maximum %3$@ HNS settlement-fee reserve. Total HNS locked: %4$@ HNS. Publishing signs and shares the fixed terms; it does not fund the atomic swap.
ar: قم بقفل %1$@ HNS لـ %2$d بالضبط. يتضمن المبلغ المقفل الحد الأقصى لاحتياطي رسوم التسوية %3$@ HNS. إجمالي HNS مقفل: %4$@ HNS. نشر اللافتات والمشاركات ذات الشروط الثابتة؛ فهو لا يمول المبادلة الذرية.
de: Sperren Sie %1$@ HNS für genau %2$d sats. Der gesperrte Betrag beinhaltet eine maximale Rückstellung für Abwicklungsgebühren %3$@ HNS. Insgesamt HNS gesperrt: %4$@ HNS. Der Verlag unterzeichnet und teilt die festgelegten Bedingungen mit; Der Atomaustausch wird dadurch nicht finanziert.
es: Bloquee %1$@ HNS exactamente para %2$d sats. El monto bloqueado incluye una reserva máxima de tarifa de liquidación %3$@ HNS. Total HNS bloqueado: %4$@ HNS. La editorial firma y comparte los términos fijados; no financia el intercambio atómico.
fa: قفل %1$@ HNS دقیقا برای %2$d sats. مبلغ قفل شده شامل حداکثر ذخیره هزینه تسویه حساب %3$@ HNS است. مجموع HNS قفل شده: %4$@ HNS. انتشار شرایط ثابت را امضا و به اشتراک می گذارد. سوآپ اتمی را تامین مالی نمی کند.
fr: Verrouillez %1$@ HNS pour exactement %2$d sats. Le montant bloqué comprend une réserve maximale pour frais de règlement %3$@ HNS. Total HNS verrouillé : %4$@ HNS. L'édition signe et partage les termes fixés ; il ne finance pas l’échange atomique.
he: נעל %1$@ HNS בדיוק עבור %2$d sats. הסכום הנעול כולל רזרבה מרבית של %3$@ HNS. סך ה-HNS נעול: %4$@ HNS. פרסום חותם ומשתף את התנאים הקבועים; זה לא מממן את ההחלפה האטומית.
hi: बिल्कुल %2$d sats के लिए %1$@ HNS को लॉक करें। लॉक की गई राशि में अधिकतम %3$@ HNS निपटान-शुल्क आरक्षित शामिल है। कुल HNS लॉक: %4$@ HNS। संकेत प्रकाशित करना और निश्चित शर्तों को साझा करना; यह परमाणु अदला-बदली को वित्त पोषित नहीं करता है।
id: Kunci %1$@ HNS tepat untuk %2$d sats. Jumlah yang dikunci mencakup cadangan biaya penyelesaian maksimum %3$@ HNS. Total HNS terkunci: %4$@ HNS. Menerbitkan tanda dan membagikan syarat-syarat yang tetap; itu tidak mendanai pertukaran atom.
it: Blocca %1$@ HNS esattamente per %2$d sats. L'importo bloccato include una riserva massima per la commissione di liquidazione %3$@ HNS. Totale HNS bloccato: %4$@ HNS. La pubblicazione firma e condivide i termini fissati; non finanzia lo scambio atomico.
ja: %1$@ HNS を正確に %2$d sats にロックします。ロックされた金額には、最大 %3$@ HNS 決済手数料準備金が含まれます。ロックされた合計 HNS: %4$@ HNS。出版者は固定条件に署名し、共有します。アトミック・スワップに資金を提供するわけではありません。
ko: 정확히 %2$d sats에 대해 %1$@ HNS를 잠급니다. 잠긴 금액에는 최대 %3$@ HNS 결제 수수료 적립금이 포함됩니다. 잠긴 총 HNS: %4$@ HNS. 고정된 조건을 게시하고 공유합니다. 아토믹 스왑에 자금을 지원하지 않습니다.
nl: Vergrendel %1$@ HNS voor precies %2$d sats.Het vergrendelde bedrag omvat een reserve van maximaal %3$@ HNS-afwikkelingskosten.Totaal HNS vergrendeld: %4$@ HNS .Uitgeverij tekent en deelt de vaste voorwaarden;het financiert de atomaire swap niet.
pl: Zablokuj %1$@ HNS dokładnie dla %2$d sats. Zablokowana kwota uwzględnia maksymalną rezerwę na opłatę rozliczeniową %3$@ HNS. Razem HNS zablokowane: %4$@ HNS. Wydawnictwo podpisuje i udostępnia stałe warunki; nie finansuje wymiany atomowej.
pt: Bloqueie %1$@ HNS exatamente para %2$d sats. O valor bloqueado inclui uma reserva máxima de taxa de liquidação %3$@ HNS. Total HNS bloqueado: %4$@ HNS. A Editora assina e partilha os termos fixos; não financia a troca atômica.
ru: Заблокируйте %1$@ HNS именно для %2$d sats. Заблокированная сумма включает максимальный резерв расчетной комиссии %3$@ HNS. Всего HNS заблокировано: %4$@ HNS. Издательство подписывает и разделяет установленные условия; он не финансирует атомный своп.
tr: Tam olarak %2$d sats için %1$@ HNS'yi kilitleyin. Kilitli tutar, maksimum %3$@ HNS uzlaşma ücreti rezervini içerir. Toplam HNS kilitli: %4$@ HNS. Yayıncılık sabit şartları imzalar ve paylaşır; atom takasını finanse etmiyor.
uk: Заблокуйте %1$@ HNS саме для %2$d sats. Заблокована сума включає максимальний резерв %3$@ HNS комісії за розрахунки. Усього заблоковано HNS: %4$@ HNS. Видавництво підписує та акції фіксовані терміни; він не фінансує атомний обмін.
vi: Khóa %1$@ HNS cho chính xác %2$d sats. Số tiền bị khóa bao gồm khoản dự trữ phí thanh toán %3$@ HNS tối đa. Tổng số HNS bị khóa: %4$@ HNS. Đăng ký và chia sẻ các điều khoản cố định; nó không tài trợ cho việc hoán đổi nguyên tử.
zh_hans: 锁定 %1$@ HNS 为 %2$d sats。锁定金额包含最高结算费用准备金%3$@ HNS。 HNS 锁定总数：%4$@ HNS。发布标志和共享固定条款；它不资助原子交换。
zh_hant: 鎖定 %1$@ HNS 為 %2$d sats。鎖定金額包含最高結算費用準備金%3$@ HNS。 HNS 鎖定總數：%4$@ HNS。發布標誌和共享固定條款；它不資助原子交換。

# wallet_swap_hns_approval_title
source: Publish HNS-for-BTC offer?
ar: نشر العرض HNS-for-BTC؟
de: HNS-für-BTC-Angebot veröffentlichen?
es: ¿Publicar oferta HNS-para-BTC?
fa: پیشنهاد HNS-for-BTC منتشر شود؟
fr: Publier l'offre HNS-pour-BTC ?
he: לפרסם את ההצעה של HNS-for-BTC?
hi: HNS-for-BTC ऑफर प्रकाशित करें?
id: Publikasikan penawaran HNS-untuk-BTC?
it: Pubblicare un'offerta HNS-per-BTC?
ja: HNS の BTC オファーを公開しますか?
ko: HNS-for-BTC 제안을 게시하시겠습니까?
nl: HNS-voor-BTC aanbieding publiceren?
pl: Opublikować ofertę HNS-for-BTC?
pt: Publicar oferta HNS-for-BTC?
ru: Опубликовать предложение HNS-для-BTC?
tr: HNS-for-BTC teklifi yayınlansın mı?
uk: Опублікувати пропозицію HNS-for-BTC?
vi: Xuất bản ưu đãi HNS-for-BTC?
zh_hans: 发布HNS换BTC报价吗？
zh_hant: 發布HNS換BTC報價嗎？

# wallet_swap_hns_fee_reserve_hint
source: HNS fee reserve
ar: احتياطي الرسوم HNS
de: HNS Gebührenreserve
es: Reserva de tarifa HNS
fa: ذخیره هزینه HNS
fr: Réserve de frais HNS
he: עתודת עמלה HNS
hi: HNS शुल्क आरक्षित
id: Cadangan biaya HNS
it: HNS riserva tariffaria
ja: HNS 手数料引当金
ko: HNS 수수료 예비
nl: HNS kostenreservering
pl: HNS rezerwa na opłaty
pt: Reserva de taxa HNS
ru: HNS резерв комиссии
tr: HNS ücret rezervi
uk: HNS Резерв комісії
vi: Dự trữ phí HNS
zh_hans: HNS 费用储备金
zh_hant: HNS 費用儲備金

# wallet_swap_hns_funding_approval_message
source: Lock %1$@ HNS. Network fee: %2$@ HNS (maximum %3$@). Transaction: %4$@ Session: %5$@ Broadcast is irreversible. The swap advances after the HNS lock is confirmed.
ar: اقفل %1$@ HNS. رسوم الشبكة: %2$@ HNS (الحد الأقصى %3$@). المعاملة: %4$@ الجلسة: %5$@ البث غير قابل للتراجع. تتقدم المبادلة بعد تأكيد قفل HNS.
de: %1$@ HNS sperren. Netzwerkgebühr: %2$@ HNS (maximal %3$@). Transaktion: %4$@ Sitzung: %5$@ Das Senden ist unumkehrbar. Der Tausch wird nach Bestätigung der HNS-Sperre fortgesetzt.
es: Bloquear %1$@ HNS. Comisión de red: %2$@ HNS (máximo %3$@). Transacción: %4$@ Sesión: %5$@ La transmisión es irreversible. El intercambio avanza después de confirmar el bloqueo de HNS.
fa: %1$@ HNS قفل شود. کارمزد شبکه: %2$@ HNS (حداکثر %3$@). تراکنش: %4$@ جلسه: %5$@ پخش برگشت‌ناپذیر است. مبادله پس از تأیید قفل HNS ادامه می‌یابد.
fr: Verrouiller %1$@ HNS. Frais réseau : %2$@ HNS (maximum %3$@). Transaction : %4$@ Session : %5$@ La diffusion est irréversible. L’échange avance après confirmation du verrouillage HNS.
he: נעילת %1$@ HNS. עמלת רשת: %2$@ HNS (מקסימום %3$@). עסקה: %4$@ הפעלה: %5$@ השידור בלתי הפיך. ההחלפה מתקדמת לאחר אישור נעילת HNS.
hi: %1$@ HNS लॉक करें। नेटवर्क शुल्क: %2$@ HNS (अधिकतम %3$@)। लेन-देन: %4$@ सत्र: %5$@ प्रसारण अपरिवर्तनीय है। HNS लॉक पुष्ट होने के बाद स्वैप आगे बढ़ता है।
id: Kunci %1$@ HNS. Biaya jaringan: %2$@ HNS (maksimum %3$@). Transaksi: %4$@ Sesi: %5$@ Penyiaran tidak dapat dibatalkan. Pertukaran berlanjut setelah kunci HNS dikonfirmasi.
it: Blocca %1$@ HNS. Commissione di rete: %2$@ HNS (massimo %3$@). Transazione: %4$@ Sessione: %5$@ La trasmissione è irreversibile. Lo scambio avanza dopo la conferma del blocco HNS.
ja: %1$@ HNSをロックします。ネットワーク手数料：%2$@ HNS（最大%3$@）。 トランザクション：%4$@ セッション：%5$@ ブロードキャストは取り消せません。HNSロックの確定後にスワップが進みます。
ko: %1$@ HNS를 잠급니다. 네트워크 수수료: %2$@ HNS(최대 %3$@). 트랜잭션: %4$@ 세션: %5$@ 브로드캐스트는 되돌릴 수 없습니다. HNS 잠금 확인 후 스왑이 진행됩니다.
nl: %1$@ HNS vergrendelen. Netwerkkosten: %2$@ HNS (maximaal %3$@). Transactie: %4$@ Sessie: %5$@ Uitzenden is onomkeerbaar. De ruil gaat verder nadat de HNS-vergrendeling is bevestigd.
pl: Zablokuj %1$@ HNS. Opłata sieciowa: %2$@ HNS (maksymalnie %3$@). Transakcja: %4$@ Sesja: %5$@ Rozgłoszenie jest nieodwracalne. Wymiana postępuje po potwierdzeniu blokady HNS.
pt: Bloqueie %1$@ HNS. Taxa de rede: %2$@ HNS (máximo %3$@). Transação: %4$@ Sessão: %5$@ A transmissão é irreversível. A troca avança após a confirmação do bloqueio HNS.
ru: Заблокировать %1$@ HNS. Комиссия сети: %2$@ HNS (максимум %3$@). Транзакция: %4$@ Сессия: %5$@ Отправка необратима. Обмен продолжится после подтверждения блокировки HNS.
tr: %1$@ HNS kilitleyin. Ağ ücreti: %2$@ HNS (azami %3$@). İşlem: %4$@ Oturum: %5$@ Yayın geri alınamaz. Takas, HNS kilidi onaylandıktan sonra ilerler.
uk: Заблокувати %1$@ HNS. Комісія мережі: %2$@ HNS (максимум %3$@). Транзакція: %4$@ Сесія: %5$@ Надсилання незворотне. Обмін продовжиться після підтвердження блокування HNS.
vi: Khóa %1$@ HNS. Phí mạng: %2$@ HNS (tối đa %3$@). Giao dịch: %4$@ Phiên: %5$@ Việc phát là không thể đảo ngược. Hoán đổi tiếp tục sau khi khóa HNS được xác nhận.
zh_hans: 锁定 %1$@ HNS。网络费用：%2$@ HNS（最高 %3$@）。 交易：%4$@ 会话：%5$@ 广播不可撤销。确认 HNS 锁定后，兑换才会继续。
zh_hant: 鎖定 %1$@ HNS。網路費用：%2$@ HNS（最高 %3$@）。 交易：%4$@ 工作階段：%5$@ 廣播無法撤銷。確認 HNS 鎖定後，兌換才會繼續。

# wallet_swap_hns_funding_approval_title
source: Broadcast HNS funding?
ar: بث تمويل HNS؟
de: HNS-Finanzierung senden?
es: ¿Transmitir la financiación en HNS?
fa: پخش تأمین وجه HNS؟
fr: Diffuser le financement HNS ?
he: לשדר מימון HNS?
hi: HNS फंडिंग प्रसारित करें?
id: Siarkan pendanaan HNS?
it: Trasmettere il finanziamento HNS?
ja: HNS資金供給をブロードキャストしますか？
ko: HNS 자금 공급을 브로드캐스트할까요?
nl: HNS-financiering uitzenden?
pl: Rozgłosić finansowanie HNS?
pt: Transmitir financiamento HNS?
ru: Отправить финансирование HNS?
tr: HNS fonlaması yayınlansın mı?
uk: Надіслати фінансування HNS?
vi: Phát giao dịch cấp vốn HNS?
zh_hans: 广播 HNS 资金交易？
zh_hant: 廣播 HNS 資金交易？
